ext_alsav_zup/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Сотрудники</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ext_alsav_zup/Catalogs/Сотрудники/Forms/ФормаЭлемента/Ext/Form/Module.bsl
перем ПервыйЗапуск;			 

&НаСервере
Процедура АЛСАВ_ПриЧтенииНаСервереПеред(ТекущийОбъект)
	// Вставить содержимое обработчика.                               
	
	флагОбновления = АЛСАВ_ОбновитьДопРеквизиты(ТекущийОбъект);	
	Если (флагОбновления) И ПервыйЗапуск тогда
		ЭтаФорма.Прочитать();		
	КонецЕсли;   
	
	ПервыйЗапуск = Ложь;
КонецПроцедуры

&НаСервере
Процедура АЛСАВ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура АЛСАВ_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	АЛСАВ_ОбновитьДопРеквизиты(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Функция АЛСАВ_ОбновитьДопРеквизиты(ТекущийОбъект)
	//Вставить содержимое обработчика   
    УстановитьПривилегированныйРежим(Истина);
	ф1 = ложь;
	ф2 = ложь;
	ф3 = ложь;
	Попытка
		ф1 = Справочники.Сотрудники.ЗаполнитьДопРеквСотрудник(ТекущийОбъект.Ссылка); 
	Исключение
	КонецПопытки;
	
	Попытка
		ф2 = Справочники.Сотрудники.ЗаполнитьДопРеквФизЛицо(ТекущийОбъект.Ссылка.ФизическоеЛицо); 
	Исключение
	КонецПопытки;
	
	Попытка
		ф3 = Справочники.Сотрудники.ЗаполнитьДопРеквОрганизация(ТекущийОбъект.Ссылка.ГоловнаяОрганизация); 
	Исключение
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат (ф1 или ф2 или ф3)
КонецФункции

ПервыйЗапуск = истина;
